Repository: arcas0803/appwrite_auth_client
Catalog: lib/localization/app_*.arb
Languages: es, pt

# emailAlreadyExists
source: Email already exists. Please try again with a different email.
es: El correo electrónico ya existe. Por favor, elija otro.
pt: O email já existe. Por favor, faça login com o seu email.

# invalidCredentials
source: Invalid credentials. Please try again with valid credentials.
es: Credenciales inválidas. Por favor, inténtelo de nuevo con credenciales válidas.
pt: Credenciais inválidas. Por favor, tente novamente.

# userDisabled
source: User has been disabled. Please contact the administrator.
es: El usuario ha sido deshabilitado. Por favor, póngase en contacto con el administrador.
pt: O usuário foi desativado. Por favor, entre em contato com o administrador.

# userNotFound
source: User not found. Please try again with a different email.
es: El usuario no se ha encontrado. Por favor, inténtelo de nuevo con credenciales válidas.
pt: O usuário não foi encontrado. Por favor, verifique o seu email.

# weakPassword
source: Password is too weak. Please try again with a stronger password with at least 8 characters.
es: La contraseña es demasiado débil. Por favor, elija una contraseña más fuerte con al menos 8 caracteres.
pt: A senha é muito fraca. Por favor, escolha uma senha mais forte com pelo menos 8 caracteres.

# emailUnverified
source: Email is not verified. Please verify your email.
es: El correo electrónico no ha sido verificado. Por favor, verifique su correo electrónico.
pt: O email não foi verificado. Por favor, verifique o seu email.

# unauthenticated
source: Unauthenticated. Please login to continue.
es: No autenticado. Por favor, inicie sesión para continuar.
pt: O usuário não está autenticado. Por favor, faça login.

# passwordMistmatch
source: Password mismatch. Please try again with the same password.
es: Las contraseñas no coinciden. Por favor, inténtelo de nuevo.
pt: A senha não corresponde. Por favor, tente novamente.

# passwordRecentlyUsed
source: Password has been recently used. Please try again with a different password.
es: La contraseña se ha utilizado recientemente. Por favor, elija una contraseña diferente.
pt: A senha foi usada recentemente. Por favor, escolha uma senha diferente.

# passwordPersonalData
source: Password contains personal data. Please try again with a different password.
es: La contraseña contiene datos personales. Por favor, elija una contraseña diferente.
pt: A senha contém dados pessoais. Por favor, escolha uma senha diferente.

# userBlocked
source: User has been blocked. Please contact the administrator.
es: El usuario ha sido bloqueado. Por favor, póngase en contacto con el administrador.
pt: O usuário foi bloqueado. Por favor, entre em contato com o administrador.

# passwordResetRequired
source: Password reset required. Please reset your password.
es: Se requiere restablecimiento de contraseña. Por favor, restablezca su contraseña.
pt: A senha precisa ser redefinida. Por favor, redefina a senha.

# unknownError
source: Unknown error. Please try again later.
es: Ha ocurrido un error desconocido. Por favor, inténtelo de nuevo.
pt: Ocorreu um erro desconhecido. Por favor, tente novamente.
